Tekla.Structures.Drawing.Circle.CircleAttributes
The CircleAttributes class is the attributes class of the circle.

Tekla.Structures.Drawing.Circle.CircleAttributes.#ctor(System.Boolean)
Creates a new default attributes instance that doesn't load attributes.

Tekla.Structures.Drawing.Circle.CircleAttributes.#ctor
Creates a new default circle attributes instance that loads standard attributes.

Tekla.Structures.Drawing.Circle.CircleAttributes.#ctor(System.String)
Creates a new circle attributes instance that loads the specified attributes.
AttributesFile: The filename of the attributes file.

Tekla.Structures.Drawing.Circle.CircleAttributes.LoadAttributes(System.String)
Loads the attributes from the attribute file.
AttributeFile: The filename of the attribute file.
Returns: True if the attributes are loaded correctly. False if the attribute file loading failed.

Tekla.Structures.Drawing.Circle.CircleAttributes.IsEqual(System.Object)
Compares the current object with an object of the same type.
ObjectToCompare: The object to be used for comparing.
Returns: True if all the fields (except for the database GUID) of the objects match.